In [2]:
import pandas as pd
import numpy as np

In [3]:
# Series 객체를 생성할 때 pd.Series()

series = pd.Series(['하나', '둘', '셋', '넷', '다섯'],
                    index = [ _ for _ in range(1,6)])

series

1    하나
2     둘
3     셋
4     넷
5    다섯
dtype: object

In [4]:
#10에서 90까지 값을 갖는 Series 생성
#rangeIndex 사용

s = pd.Series([ _ for _ in range(10,100,10)])
s

# pd.Series(list(range(10,100,10)))  <이렇게합시다...:)

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [5]:
# 각 도시의 2015년 인구 데이터를 series로 만들기~
# 읽기 쉽게 하기 위해 콤마로 3자리씩 끊어 표기하는 법 _로!

s = pd.Series( [9_904_312, 3_448_737, 2_890_451, 2_466_052],
              index=['서울', '부산', '인천', '대구'])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [6]:
pd.Series(range(10,14))

#index와 value의 개수는 동일해야 함.
#index를 지정하지 않으면 0부터 시작하는 정수 값(rangeIndex)

0    10
1    11
2    12
3    13
dtype: int64

In [7]:
# 앞서 만든 연습문제의 Series 객체의 값 중 50보다 큰 값의 개수

print(s.values)
sum(s.values[:]>50) #하하 sum을 하면 되는군요:)

[9904312 3448737 2890451 2466052]

4

In [8]:
d = {'a':1, 'b':2, 'c':3}
ser = pd.Series(data=d, index=['c','a','b'])  #index 순서대로 딕셔너리 위치 바뀜
                                        #딕셔너리는 순서가 없는 데이터(비시퀀스)
print(ser)

ser2 = pd.Series(data=d, index=['c','a','b1']) #없는 키를 입력하면 
print(ser2)                                    #Nan 값 뜸

c    3
a    1
b    2
dtype: int64
c     3.0
a     1.0
b1    NaN
dtype: float64

In [9]:
#연습문제 이름 index, 점수 values로 하는 series 만들기

score = pd.Series([88,95,100,67],
                  index=['철수','영희','길동','몽룡'])
score

철수     88
영희     95
길동    100
몽룡     67
dtype: int64

In [10]:
#index를 속성처럼 활용하기
print(score.철수)

score.철수, score.영희, score.몽룡

#가능합니다.

88

(88, 95, 67)

In [11]:
ser.a

1

In [12]:
#index label을 키(key)로 사용하므로
#딕셔너리처럼 in, items() method 사용하며 요소의 키, 값에 접근 가능

print('서울' in s, '\n')

for k, v in s.items():
    print(f'{k}, {v}')

True

서울, 9904312
부산, 3448737
인천, 2890451
대구, 2466052

In [13]:
test = dict( zip(range(10), list('영일이삼사오육칠팔구')) )
            #zip으로 dict에 키, 값을 넣어줌

for k, v in test.items():
    print(f'{k}, {v}')    #하나씩 꺼내줍니다
    
print('\n')
print('영 in test.values(): ', '영' in test.values())
print('서울 in s: ', '서울' in s)

0, 영
1, 일
2, 이
3, 삼
4, 사
5, 오
6, 육
7, 칠
8, 팔
9, 구


영 in test.values():  True
서울 in s:  True

In [14]:
pop = pd.Series( [9_904_312, 3_448_737, 2_890_451, 2_466_052],
              index=['서울', '부산', '인천', '대구'])
#population
#도시의 인구가 300만이 넘는 곳을 찾아 다음과 같이 출력해보세요.
# 서울의 인구는 300만이 넘습니다.
# for, items() 사용

for a, b in pop.items():
    if b>=3000000:
        print(f'{a}의 인구는 300만이 넘습니다.')

서울의 인구는 300만이 넘습니다.
부산의 인구는 300만이 넘습니다.

In [15]:
print(pop['서울'], pop[0], '\n')
print(pop[[2, 3, 1]], '\n')
print(pop[['대구', '부산']], '\n')
#pop.0은 안 됨
print(pop.서울)

9904312 9904312

인천    2890451
대구    2466052
부산    3448737
dtype: int64

대구    2466052
부산    3448737
dtype: int64

9904312

In [16]:
#인천의 인덱스와 값을 시리즈로 조회해보세요.
pop[['인천']]

인천    2890451
dtype: int64

In [17]:
print(pop,'\n')
print(pop[1:3], '\n')
print(pop['부산':'대구'])

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

부산    3448737
인천    2890451
dtype: int64

부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [18]:
#2015년도 인구, 2010년도 인구 비교(증감)
#근데 이제 대구 대신 대전을 포함한
pop15 = pop
pop10 = pd.Series({'서울':9631482, '부산':3393191, '인천':2632035, '대전':1490158})

popM = pop15-pop10

#계산이 불가능한 데이터는 NaN(Not a Number) 값을 가짐

In [19]:
popM.isnull()
#NaN -> True null 값입니다.
#값 있으면 False

대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool

In [20]:
popM.notnull()
#반대~

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [21]:
#NaN이 아닌 값만 인덱싱으로 구하기

print( popM[ popM.isnull() ], '\n' )
print( popM[ popM.notnull() ], '\n' )

print(pop[ pop>3000000 ] )

대구   NaN
대전   NaN
dtype: float64

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

서울    9904312
부산    3448737
dtype: int64

In [22]:
#Nan 값을 배제하고 2010년 대비 2015년의 인구 증가율 구하기

popP = (pop15 - pop10) / pop10 * 100
popP = popP[ popP.notnull() ]    #notnull true인 값만 popP에 추가~
popP

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [23]:
#2010년 대비 2015년 증가량 구하기(NaN값 배제)
#인구수 증가가 가장 많은 도시의 이름과 증가한 인구수를 series 객체로 출력

popPlus = pop15 - pop10
popPlus = popPlus[ popPlus.notnull() ]
popPlus[ popPlus == popPlus.max() ]

서울    272830.0
dtype: float64

In [24]:
#강사님 답변
popPlus = pop15 - pop10
popPlus = popPlus[ popPlus.notnull() ]
popPlus[[popPlus.values.argmax()]]

서울    272830.0
dtype: float64

In [25]:
#갱신
popP.서울 = 2.83
popP['인천'] = 9.82

popP['부산':'서울'] = 1.63, 2.83
popP['울산'] = 1.03
del popP['서울']

popP

부산    1.63
인천    9.82
울산    1.03
dtype: float64

In [26]:
popM.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [27]:
fin1 = {'카카오': 60010, '삼성전자': 61000, 'LG전자': 90000}
fin2_value = [60200, 61200, 200100]
fin2_index = ['카카오', '삼성전자', '네이버']

ser_finance1 = pd.Series(fin1)
ser_finance2 = pd.Series(fin2_value, index = fin2_index )

ser_finance1

카카오     60010
삼성전자    61000
LG전자    90000
dtype: int64

In [28]:
ser_finance2

카카오      60200
삼성전자     61200
네이버     200100
dtype: int64

In [29]:
ser_finance1 - ser_finance2

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64

In [30]:
ser_finance1 + ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    122200.0
카카오     120210.0
dtype: float64

In [31]:
ser_finance1 * ser_finance2

LG전자             NaN
네이버              NaN
삼성전자    3.733200e+09
카카오     3.612602e+09
dtype: float64

In [32]:
ser_finance1 / ser_finance2

LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

In [41]:
result = ser_finance1 - ser_finance2
result[result.notnull()]    #nan 값 빼고 저장하기

삼성전자   -200.0
카카오    -190.0
dtype: float64

In [ ]:
pd.DataFrame( data=None, index:'key'=None)

In [42]:
d = {'col1' : [1, 2], 'col2': [3,4] }  #열 이름이 key, 값들이 value
df = pd.DataFrame(data=d)
df

   col1  col2
0     1     3
1     2     4

In [43]:
data = {
    "2015" : [9904312, 3448737, 2890451, 2466052],
    "2010" : [9631482, 3393191, 2632035, 2431774],
    "2005" : [9762546, 3512547, 2517680, 2456016],
    "2000" : [9853972, 3655437, 2466338, 2473990],
    "지역" : ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율" :[0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index = index, columns = columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [45]:
# dataFrame 자료형 확인
# 각 열 별로 자료형이 다를 수 있다.
df.dtypes #dtype이 아닌 dtypes!

지역                object
2015               int64
2010               int64
2005               int64
2000               int64
2010-2015 증가율    float64
dtype: object

In [46]:
print(df.values, '\n')
print(df.columns, '\n')
df.index

[['수도권' 9904312 9631482 9762546 9853972 0.0283]
 ['경상권' 3448737 3393191 3512547 3655437 0.0163]
 ['수도권' 2890451 2632035 2517680 2466338 0.0982]
 ['경상권' 2466052 2431774 2456016 2473990 0.0141]]

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [50]:
df.index.name = '도시'    #행이름의 그룹이름 
df.columns.name = '특성'  #열이름의 그룹이름

In [49]:
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [66]:
data = {
    "Special Color":['Midnight Green','Pacific Blue', 'Alpine Green', 'Deep Purple' ],
    "Display Size":[5.8, 6.1, 6.1, 6.1 ],
    "Running Time":[18, 17, 22, 23 ],
    "Bionic Chip": ['A13', 'A14', 'A15', 'A16' ]
}

index = ['iPhone11Pro', 'iPhone12Pro', 'iPhone13Pro', 'iPhone14Pro']

iPhone = pd.DataFrame(data = data, index = index)
iPhone.columns.name = 'Summary'
iPhone

Summary       Special Color  Display Size  Running Time Bionic Chip
iPhone11Pro  Midnight Green           5.8            18         A13
iPhone12Pro    Pacific Blue           6.1            17         A14
iPhone13Pro    Alpine Green           6.1            22         A15
iPhone14Pro     Deep Purple           6.1            23         A16

In [53]:
iPhone.dtypes

Summary
Special Color     object
Display Size     float64
Running Time       int64
Bionic Chip       object
dtype: object

In [58]:
#주현주현 왜 나랑 안 노라죠
#나랑 노라죠
#공부 하지뭬
#난 내일 늦게 와
#한번 상담사분깨 물어볼게
#히히히히히히히

In [67]:
# dataFrame 추가, 갱신, 삭제

# 열 추가 ( inch *25.4 = mm )
iPhone ['Display Size(mm)'] = iPhone['Display Size']*25.4

In [68]:
# 열 갱신
# iPhone['Display Size'] = ['5.8 inch', '6.1 inch', '6.1 inch', '6.1 inch']

del iPhone['Bionic Chip']

In [69]:
iPhone

Summary       Special Color  Display Size  Running Time  Display Size(mm)
iPhone11Pro  Midnight Green           5.8            18            147.32
iPhone12Pro    Pacific Blue           6.1            17            154.94
iPhone13Pro    Alpine Green           6.1            22            154.94
iPhone14Pro     Deep Purple           6.1            23            154.94

In [79]:
#열 다시 추가
iPhone["Bionic Chip"] = ['A13', 'A14', 'A15', 'A16' ]  #같은 문자열

In [80]:
iPhone

Summary,Special Color,Display Size,Running Time,Display Size(mm),Bionic Chip
iPhone11Pro,Midnight Green,5.8,18,147.32,A13
iPhone12Pro,Pacific Blue,6.1,17,154.94,A14
iPhone13Pro,Alpine Green,6.1,22,154.94,A15
iPhone14Pro,Deep Purple,6.1,23,154.94,A16

In [81]:
iPhone['Special Color']  # index도 시리즈 객체로 같이 반환된당

iPhone11Pro    Midnight Green
iPhone12Pro      Pacific Blue
iPhone13Pro      Alpine Green
iPhone14Pro       Deep Purple
Name: Special Color, dtype: object

In [85]:
iPhone[['Special Color'] ]  #dataframe 방식으로 반환하기

Summary       Special Color
iPhone11Pro  Midnight Green
iPhone12Pro    Pacific Blue
iPhone13Pro    Alpine Green
iPhone14Pro     Deep Purple

In [ ]:
#문자열 label일 때는 정수 index사용불가능.
#key Error 발생함

iPhone[0]

#문자열 label 아니고 기본 정수형 column index를 가지는 경우에는 index 값으로 정수 사용 가능

In [88]:
df2 = pd.DataFrame(np.arange(12).reshape(3, 4))
print(df2, '\n')
print(df2[2])

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

0     2
1     6
2    10
Name: 2, dtype: int32

In [90]:
#iPhone['iPhone13Pro'] row 단위로 인덱싱 못 함.
#column으로 먼저 접근 후 row로 도려내기는 가능
iPhone['Special Color']['iPhone13Pro']
# 나중에 나오는 at을 더 많이 사용함

'Alpine Green'

In [92]:
#연습문제

data = {
    '국어': [80,90,70,30],
    '영어': [90,70,60,40],
    '수학': [90,60,80,70]
}
columns = ['국어', '영어', '수학']
index = ['춘향', '몽룡', '향단', '방자']
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [112]:
# 1) 모든 학생의 수학 점수를 Series
pd.Series(df['수학'])

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [ ]:
# 2) 모든 학생의 국어와 영어점수를 데이터 프레임
df[['국어','영어']]

In [103]:
#3) 모든 학생, 각 과목 평균 점수를 새로운 열로 추가
avg =[]

for i in index:
    sumv = 0
    for c in columns:
        sumv += df[c][i]
    avg.append(sumv/3)
df['평균점수'] = avg
df

    국어  영어  수학       평균점수
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [128]:
df['평균'] = round((df['국어']+df['영어']+df['수학'])/3, 2)
df

    국어  영어  수학       평균점수     평균
춘향  80  90  90  86.666667  86.67
몽룡  90  70  60  73.333333  73.33
향단  70  60  80  70.000000  70.00
방자  30  40  70  46.666667  46.67

In [122]:
# 4) 춘향의 점수를 DataFrame
ch = pd.DataFrame(data = [df['국어']['춘향'], df['영어']['춘향'], df['수학']['춘향']],
                  index = columns, columns = ['춘향의 점수'] )

#ch = pd.DataFrame(data=df[[df[_]['춘향'] for _ in columns]], columns = ['춘향의 점수'] )
ch

    춘향의 점수
국어      80
영어      90
수학      90

In [126]:
df.T[['춘향']] #전치 (Transpose)

             춘향
국어    80.000000
영어    90.000000
수학    90.000000
평균점수  86.666667

In [130]:
df[:1] #df['춘향':'춘향']

    국어  영어  수학       평균점수     평균
춘향  80  90  90  86.666667  86.67

In [114]:
# 5) 향단의 점수를 Series
pd.Series( [df[_]['향단'] for _ in columns])

0    70
1    60
2    80
dtype: int64

In [127]:
pd.Series( df.T['향단'] )  #전치 (Transpose)

국어      70.0
영어      60.0
수학      80.0
평균점수    70.0
Name: 향단, dtype: float64

In [133]:
df.T['향단'] #Series로 감싸지 않아도 됨 column에 대한 반환값은 자동으로 시리즈~!

국어      70.0
영어      60.0
수학      80.0
평균점수    70.0
평균      70.0
Name: 향단, dtype: float64

In [ ]:
# df.loc[index] 로 향단이 가져오면 됨

In [156]:
#연습문제
#다음 DataFrame을 만들어 보세요
"""
- 랜덤 시드는 0입니다.
- values는 넘파이 서브 패키지 중 random의 randn() 메서드를 사용하세요.
- index는 pd.date_range("20130226", periods=날짜수)을 활용하세요.
"""

import numpy as np
np.random.seed(0)

index = pd.date_range("20130226", periods=6)

pd.DataFrame( data = np.random.randn(24).reshape(6, 4),
             index = index, columns = ['A', 'B', 'C', 'D'] )

                   A         B         C         D
2013-02-26  1.764052  0.400157  0.978738  2.240893
2013-02-27  1.867558 -0.977278  0.950088 -0.151357
2013-02-28 -0.103219  0.410599  0.144044  1.454274
2013-03-01  0.761038  0.121675  0.443863  0.333674
2013-03-02  1.494079 -0.205158  0.313068 -0.854096
2013-03-03 -2.552990  0.653619  0.864436 -0.742165